[
    {
        "id": 0,
        "title": {
          "special": "International Call Center "
        },
        "content": [
          {
            "body": "Access our dedicated international call center for prompt and efficient customer support."
          },
          {
            "heading": "Multi-language services",
            "body": "At TMIS, we recognize the pivotal role that multilingual customer services play in elevating customer satisfaction. We highly value the diversity of languages and invest in cultivating the skills of our team through professional training programs. Our commitment is to empower our talented workforce, ensuring they are proficient in multiple languages to bring added value to both your customers and your business."
          },
          {
            "heading": "Platform stability",
            "body": "We believe stable network service system can create reliable service quality to customers, thus it brings reliable brand image and strengthen relationship to your customers."
          },
          {
            "heading": "Global market connection",
            "body": "TMIS introduces a dynamic global communication platform designed to effortlessly connect routes on a global scale. With our innovative solution, you can sidestep the need to establish customer service offices in every country, streamlining your operations and optimizing resources."
          }
        ]
      },
      {
        "id": 1,
        "title": {
          "special": "Consumer Satisfaction Survey / Mystery Shoppers "
        },
        "content": [
          {
            "body": "At TMIS, we excel in the art of collecting valuable information directly from customers, uncovering the intricacies of their thoughts. Our dedicated efforts go beyond mere data collection – we aim to provide you with profound insights that keep your business relevant and in tune with your customers' ever-evolving wants and needs."
          },
          {
            "heading": "Customers feedback collection",
            "body": "At TMIS, we recognize that customer opinions are the cornerstone of staying relevant and a valuable reference for continuous improvement. We are dedicated to collecting and analyzing customer information, unraveling their needs, understanding service processes, and harnessing these insights as a benchmark for future enhancements."
          },
          {
            "heading": "Maintain service quality",
            "body": "At TMIS, we understand the significance of staying informed about employee status. Our approach involves trained agents simulating diverse scenarios, gaining valuable insights into service processes and frontline staff requirements. Our Mystery Shopping service is designed to empower your business by maintaining a high-level of service quality and offering tailored suggestions for internal training."
          },
          {
            "heading": "Market survey",
            "body": "Staying aware of market trends is important for your business, Eason sourcing International provide market survey service to help you understand market and customers insight for future reference."
          }
        ]
      },
      {
        "id": 2,
        "title": {
          "special": "Promotional Booking Service "
        },
        "content": [
          {
            "body": "At TMIS, we prioritize gathering essential information from customers regarding maintenance status and service processes. Throughout this collection process, we extend personalized invitations to customers who haven't yet pursued car maintenance, strategically uncovering potential revenue opportunities."
          },
          {
            "heading": "Expand potential opportunities",
            "body": "At TMIS, our agents take a proactive approach by inviting car owners for essential maintenance services. Simultaneously, we engage in thoughtful information collection from customers, transforming this data into invaluable insights that fuel effective promotion strategies for your business."
          },
          {
            "heading": "Instant complaint notice",
            "body": "At TMIS, we recognize that understanding the reasons behind customer frustration is a vital aspect of any successful business. We actively gather information and lend a keen ear to the voices of our customers. By doing so, we not only provide valuable insights but also coordinate this information to formulate effective business solutions."
          }
        ]
      },
      {
        "id": 3,
        "title": {
          "special": "AI Services"
        },
        "content": [
          {
            "body": "At TMIS, we recognize that over 50% of service requests are repetitive, and we see an opportunity to revolutionize the customer service landscape through AI innovation. With this in mind, we are actively developing AI voice chat bot technology to assist both customers and agents, offering an enhanced AI-Agent solution."
          }
        ]
      }
]